---
kind: type
id: T:Autodesk.Revit.DB.Structure.BentFabricStraightWiresLocation
source: html/366283e6-dcb6-d863-13e0-32937d93a499.htm
---
# Autodesk.Revit.DB.Structure.BentFabricStraightWiresLocation

Bent Fabric straight wires location.
 The side on wich straight wires will be loacted is determined by the start and end point of the first bent profile segment that specifies the direction of the curve loop on plane.

## Syntax (C#)
```csharp
public enum BentFabricStraightWiresLocation
```